tests/com/l7tech/service/resources/websphereSignedRequest.xml

<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext" soapenv:mustUnderstand="1">
      <wsse:BinarySecurityToken xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" EncodingType="wsse:Base64Binary" ValueType="wsse:X509v3" wsu:Id="wssecurity_binary_security_token_id_1169629248054106215">
        MIICADCCAWmgAwIBAgIIbin/wb5EyyAwDQYJKoZIhvcNAQEFBQAwFDESMBAGA1UEAxMJ
        cm9vdC53c2FkMB4XDTA0MDgxNzIyMjAyNloXDTA2MDgxNzIyMzAyNlowDzENMAsGA1UE
        AxMEd3NhZDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEArTeqDuSbORI3+ReH85Cd
        REgTM4A+VzF1ABFOhC19eBm43+N8iAxbArbjQ7Kt15wCssT6Tk5bIM0xP4zzX5aIi+BK
        f+IXO45ZB2erkCaw3WemTBeVgEmmEgmBQDXhL3QojO6piDGgeVh/QNMj0Gc0SHrEvN/4
        GAfPX/NLVvAQXfsCAwEAAaNgMF4wDAYDVR0TAQH/BAIwADAOBgNVHQ8BAf8EBAMCBaAw
        HQYDVR0OBBYEFIUaP06TuKoxDhwPeGxPujE3CfndMB8GA1UdIwQYMBaAFMHxGvsbZm8u
        oaWvpIX1MgSLGjdYMA0GCSqGSIb3DQEBBQUAA4GBALYnkpW5/oLnwJgYBv2JTVZo65Ps
        5whFU6qiLyuIsVu7W3V8yB+L95eH2z8iakL3FztcQ37j6JbiPHeqyDeJGumgDd5cNOsn
        R1xpLdq8B9LT4UVkq6Tw5PLxBL4Wc89s+68/lAXRyLktaf0oEyA23RsM5GR53betwJCu
        wqmdtNde
      </wsse:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
          <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></SignatureMethod>
          <Reference URI="#wssecurity_body_id_9119552724904345093">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsi soapenc xsd #default wsu soapenv "></ec:InclusiveNamespaces>
              </Transform>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
            <DigestValue>sV+8Wjws3RtZzVRqW7pe1HxzBZU=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
                SA/KL5LekjhQlzxpT+JpcoJOlhEW9elzdw5oKrz0BmYKqVGDVtmW5jqQ/YRn
                gZoT/+RAvpFc1GN/PEeMlacexSI7DCfbev7reZVoggwZwPzNmcP7dcoj77P/
                hqAqIist2jRG/yz5CRTjtFfnXOMYt4pZUspxPpgoGr8Y0YKJY+c=
        </SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#wssecurity_binary_security_token_id_1169629248054106215"></wsse:Reference>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" wsu:Id="wssecurity_body_id_9119552724904345093"><getTheTime xmlns="http://acpkg"></getTheTime></soapenv:Body></soapenv:Envelope>